Revit 2025 API
ExternalDataInstanceAddedIntoDocumentEventArgs.ProjectId Property
 The id of the external project of the external data item to which a new reference has been added.
Namespace: Autodesk.Revit.DB.Events
Assembly: RevitAPI (in RevitAPI.dll) Version: 25.0.0.0 (25.0.0.0)
Syntax
public string ProjectId { get; }
Public ReadOnly Property ProjectId As String
	Get
public:
property String^ ProjectId {
	String^ get ();
}
member ProjectId : string with get
Property Value
String
See Also
Reference
ExternalDataInstanceAddedIntoDocumentEventArgs Class
Autodesk.Revit.DB.Events Namespace